*&---------------------------------------------------------------------*
*& Include          ZRSUWON02_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0100 OUTPUT.
 SET PF-STATUS 'STATUS100'.
 SET TITLEBAR 'T100'.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module DISPLAY_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE display_alv_0100 OUTPUT.
  IF GC_DOCKING IS INITIAL.
    PERFORM CREATE_OBJECT. " 객체 생성
    PERFORM FIELD_CATALOG. "필드 카탈로그
    PERFORM EVENT.
    PERFORM ETC. "VARIANT / TOOLBAR 등등
    PERFORM LAYOYT. "레이아웃
    PERFORM DISPLAY_ALV. "출력 메소드
  ELSE.
    PERFORM REFRESH.
  ENDIF.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module STATUS_0200 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0200 OUTPUT.
 SET PF-STATUS 'STATUS200'.
 SET TITLEBAR 'T200'.
ENDMODULE.
